# -*- coding: utf-8 -*-

# Контрольная работа Udemy. Тема №1 "Типы и модели данных"

a = 5
print(
    'Переменная:', a,
    'Тип переменной: ', type(a),
    'Идетификатор переменной: ', id(a))

b = 12
print(
    'Переменная:', b,
    'Тип переменной: ', type(b),
    'Идетификатор переменной: ', id(b))

c = 5.7
print(
    'Переменная:', c,
    'Тип переменной: ', type(c),
    'Идетификатор переменной: ', id(c))

a = 12
print(
    'Переменная:', a,
    'Тип переменной: ', type(a),
    'Идетификатор переменной: ', id(a))

a = 5.7
print(
    'Переменная:', a,
    'Тип переменной: ', type(a),
    'Идетификатор переменной: ', id(a))

d = e = f = 125
print(
    'Переменные:', d, e, f,
    'Типы переменных: ', type(d), type(e), type(f),
    'Идетификаторы переменных: ', id(d), id(e), id(f))

# TODO: Прослушать урок Udemy про идетнификаторы и объяснить, почему при присвоении одного значения переменной, идетификатор одинаковый