# 6.	Дано некоторое целое число. Вывести на экран сумму всех целых чисел от 0 и до заданного числа включительно.

n = 10

summ = n * (n + 1) / 2
print(summ)

